"""
АЛГОРИТМЫ

Дискретность - Алгоритм разбит на отдельные шаги
Определенность (детерменированность). Каждый шаг алгоритма однозначно понятен и не допускает разных трактовок
Результативность. Выполнение алгоритма приводит к получению результата или решение поставленной задачи
Конечность. Алгоритм всегда завершается за конечное число шагов

Виды алгоритмов:
1. линейные алгоритмы. Шаги выполняются последовательно один за другим if/else
2. Алгоритмы с ветвлением. В таких алгоритмах присутствуют условия от проверки которого зависит каким будет дальнейший путь if/else
3. Циклические алгоритмы. В них присутствуют повторение определенных действий многократно. for, while

налить чай в чайник -> Включить чайник -> ...

ЕСЛИ ... ТО ... ИНАЧЕ...

--------

--------
"""

# if, if-else, if-elif-else
# var = 7
# var == 1
# var != 1
# var >

# var = 10
# my_bool = var > 8
# if my_bool == False:
#     print("Привет!")
# else:
#     print("Пока!")
#
# and, or, not
#
# """
# x = 15
# and:
# x > 0 and x < 10
# """
# if username == "admin" and password == "secret_password":
#
# """
# x = 15
# or:
# x < 0 or x > 10
# """
#
# """
# not:
# """
# is_valid = True
# not is_valid
#
#
# day = "45345"
# prazdnik = True
#
# if day == "Monday" or not prazdnik:
#     print("Сегодня выходной день!")
# else:
#     print("Сегодня рабочий день")

# x = -3
# x > 0 and x % 2 == 0
#
# if, if-else, if-elif-else
#
# if условие_1:
#     блок_кода_1
# elif условие_2:
#     блок_кода_2
# elif условие_3:
#     блок_кода_3
# else:
#     блок_кода_4
#
#
# x = -343
# if x % 2 == 0:
#     print("Число четное")
# else:
#     print("Число нечетное")

# age = int(input("Возраст: "))
#
# if age < 7:
#     print("Вы школьник")
# if age < 15:
#     print("Вы все еще школьник")
# if age <= 18:
#     print("Вы почти не школьник")
# elif age < 65:
#     print("Пора работать")
# else:
#     print("Вы пенсионер")


is_raining = False
temp = -2

if is_raining:
    if temp == 0:
        print("идет снег")
    else:
        print("идет дождь")
else:
    if temp > 0:
        print("осадков нет но тепло")
    else:
        print("осадков нет но холодно")